samples/personal-info/out/rdra_buc_bucpassword.mmd
graph TD
  User(["👤 User"])
  ChangePassword(["Change Password"])
  RequestPasswordReset(["Request Password Reset"])
  ResetPassword(["Reset Password"])
  SetInitialPassword(["Set Initial Password"])
  BucPassword["📦 Manage Password"]
  AuditLog[("🗄 Audit Log")]
  PasswordCredential[("🗄 Password Credential")]
  UserAccount[("🗄 User Account")]
  PasswordChangeScreen[["Password Change Screen"]]
  PasswordResetScreen[["Password Reset Screen"]]
  PasswordSetScreen[["Password Setup Screen"]]
  User --> BucPassword
  BucPassword --> PersonalDataMgmt
  BucPassword --> SetInitialPassword
  BucPassword --> ChangePassword
  BucPassword --> RequestPasswordReset
  BucPassword --> ResetPassword
  PasswordCredential --- UserAccount
  AuditLog --- UserAccount
  SetInitialPassword -.->|displays| PasswordSetScreen
  ChangePassword -.->|displays| PasswordChangeScreen
  RequestPasswordReset -.->|displays| PasswordResetScreen
  ResetPassword -.->|displays| PasswordResetScreen
