samples/personal-info/out/rdra_buc_password.puml
@startuml
!theme plain

actor "User" as User

usecase "Change Password" as ChangePassword
usecase "Request Password Reset" as RequestPasswordReset
usecase "Reset Password" as ResetPassword
usecase "Set Initial Password" as SetInitialPassword

rectangle "Manage Password" as BucPassword



database "Audit Log" as AuditLog
database "Password Credential" as PasswordCredential
database "User Account" as UserAccount

boundary "Password Change Screen" as PasswordChangeScreen
boundary "Password Reset Screen" as PasswordResetScreen
boundary "Password Setup Screen" as PasswordSetScreen



User --> BucPassword
BucPassword ..> PersonalDataMgmt : belongs
BucPassword ..> SetInitialPassword : contains
BucPassword ..> ChangePassword : contains
BucPassword ..> RequestPasswordReset : contains
BucPassword ..> ResetPassword : contains
PasswordCredential -- UserAccount
AuditLog -- UserAccount
SetInitialPassword ..> PasswordSetScreen : displays
ChangePassword ..> PasswordChangeScreen : displays
RequestPasswordReset ..> PasswordResetScreen : displays
ResetPassword ..> PasswordResetScreen : displays
@enduml
